tokihk/sdbox/src_board/nxp_mimxrt1180_evk/driver/xethernet_board.h
/*
 * xethernet_board.h
 *
 *  Created on: 2024/03/27
 *      Author: Hitoshi Kono
 */

#ifndef XETHERNET_BOARD_H_
#define XETHERNET_BOARD_H_

#include "board.h"

#include "lwip/pbuf.h"

#include "netc/fsl_netc.h"
#include "netc/fsl_netc_endpoint.h"

#include "fsl_phyrtl8201.h"
#include "fsl_phyrtl8211f.h"


#define NETC_EP_FRAME_LEN_MAX			(ENET_FRAME_MAX_FRAMELEN + ENET_FRAME_VLAN_TAGLEN)

#define ENET1G_TXBUFF_SIZE				(ENET1G_FRAME_LEN_MAX)
#define ENET1G_RXBUFF_SIZE				(ENET1G_FRAME_LEN_MAX)

#define ENET1G_TXBD_NUM					(24)
#define ENET1G_RXBD_NUM					(24)

#define ENET1G_RXBUFF_NUM				(ENET1G_RXBD_NUM * 2)

#define ENET1G_MAX_BUFFERS_PER_FRAME	((ENET1G_FRAME_LEN_MAX / ENET1G_RXBUFF_SIZE) + ((ENET1G_FRAME_LEN_MAX % ENET1G_RXBUFF_SIZE == 0) ? 0 : 1))

#define NETC_EP_BUFF_SIZE_ALIGN			64U
#define NETC_EP_BD_ALIGN				128U

#define NETC_EP_RXRING_NUM				3U
#define NETC_EP_RXBD_NUM				8U
#define NETC_EP_RXBUFF_SIZE				1522U
#define NETC_EP_RXBUFF_SIZE_ALIGN		SDK_SIZEALIGN(NETC_EP_RXBUFF_SIZE, NETC_EP_BUFF_SIZE_ALIGN)

#define NETC_EP_TXRING_NUM				3U
#define NETC_EP_TXFRAME_NUM				20U
#define NETC_EP_TXBD_NUM				8U
#define NETC_EP_TXBUFF_SIZE				1522U
#define NETC_EP_TXBUFF_SIZE_ALIGN		SDK_SIZEALIGN(NETC_EP_TXBUFF_SIZE, NETC_EP_BUFF_SIZE_ALIGN)


typedef enum xether_netc_id
{
	XETHER_NETC0,					/* ENETC0 */
	XETHER_NETC1,					/* ENETC1 */

	XETHER_NETC_NUM
} xether_netc_ep_id_t;


typedef struct xether_rx_pbuf_wrapper
{
	struct pbuf_custom			p;				/*!< Pbuf wrapper. Has to be first. */
	void *						buffer;			/*!< Original buffer wrapped by p. */
	volatile bool_t				buffer_used;	/*!< Wrapped buffer is used by ENET or lwIP. */
} xether_rx_pbuf_wrapper_t;

typedef struct xether_device_status
{
	uint32_t					rx_packet_count;
	uint32_t					tx_packet_count;
} xether_device_status_t;

typedef struct xether_netc_config
{
	netc_hw_si_idx_t			hw_si_id;
} xether_netc_config_t;

typedef struct xether_ep_status
{
	phy_speed_t					last_speed;
	phy_duplex_t				last_duplex;
	bool_t						last_link_up;
} xether_ep_status_t;

typedef struct xether_netc_port_handle
{
	phy_handle_t				phy_handle;
	phy_rtl8211f_resource_t		phy_resource;

	netc_hw_si_idx_t			hw_si_id;

	xether_ep_status_t			status;
} xether_netc_port_handle_t;

static struct
{
	ENET_Type *					enet_base;
	enet_handle_t				enet_handle;

	uint32_t					txFlag;

	enet_tx_bd_struct_t *		tx_buff_descrip;
	enet_rx_bd_struct_t *		rx_buff_descrip;

	xether_enet1g_tx_buff_t *	tx_data_buff;
	xether_enet1g_rx_buff_t *	rx_data_buff;

	xether_rx_pbuf_wrapper_t	rxpbuf_list[ENET1G_RXBUFF_NUM];
	uint16_t					rxpbuf_index;

	uint8_t						send_frame_buff[ENET1G_FRAME_LEN_MAX];

	phy_handle_t				phy_handle[XETHER_NEC_EP_NUM];
	phy_speed_t					last_speed;
	phy_duplex_t				last_duplex;
	bool_t						last_link_up;
} g_xether_enet1g;


typedef uint8_t										netc_ep_rx_buffer_t[NETC_EP_RXBUFF_SIZE_ALIGN];
typedef uint8_t										netc_ep_tx_buffer_t[NETC_EP_TXBUFF_SIZE_ALIGN];

AT_NONCACHEABLE_SECTION_ALIGN(static netc_rx_bd_t			g_rxBuffDescrip[NETC_EP_RXRING_NUM][NETC_EP_RXBD_NUM], NETC_EP_BD_ALIGN);
AT_NONCACHEABLE_SECTION_ALIGN(static netc_ep_rx_buffer_t	g_rxDataBuff[NETC_EP_RXRING_NUM][NETC_EP_RXBD_NUM], NETC_EP_BUFF_SIZE_ALIGN);
AT_NONCACHEABLE_SECTION_ALIGN(static uint8_t				g_rxFrame[NETC_EP_RXBUFF_SIZE_ALIGN], NETC_EP_BUFF_SIZE_ALIGN);

AT_NONCACHEABLE_SECTION_ALIGN(static netc_ep_tx_buffer_t	g_txFrame[NETC_EP_TXBUFF_SIZE], NETC_EP_BUFF_SIZE_ALIGN);

AT_NONCACHEABLE_SECTION_ALIGN(static netc_tx_bd_t			g_mgmtTxBuffDescrip[NETC_EP_TXBD_NUM], NETC_EP_BD_ALIGN);
AT_NONCACHEABLE_SECTION_ALIGN(static netc_cmd_bd_t			g_cmdBuffDescrip[NETC_EP_TXBD_NUM], NETC_EP_BD_ALIGN);


static uint64_t												g_rxBuffAddrArray[NETC_EP_RXRING_NUM][NETC_EP_RXBD_NUM];
static netc_tx_frame_info_t									g_mgmtTxDirty[NETC_EP_TXBD_NUM];
static netc_tx_frame_info_t									g_mgmtTxFrameInfo;

AT_NONCACHEABLE_SECTION_ALIGN(static netc_tx_bd_t	g_txBuffDescrip[NETC_EP_TXRING_NUM][NETC_EP_TXBD_NUM], NETC_EP_BD_ALIGN);
static netc_tx_frame_info_t							g_txDirty[NETC_EP_TXRING_NUM][NETC_EP_TXBD_NUM];


/* PHY operation. */
static netc_mdio_handle_t			g_mdio_handle;
static phy_rtl8201_resource_t		g_phy_rtl8201_resource;

static const phy_operations_t		g_app_phy_rtl8201_ops =
{
		.phyInit            = APP_PHY_RTL8201_Init,
		.phyWrite           = PHY_RTL8201_Write,
		.phyRead            = PHY_RTL8201_Read,
		.getAutoNegoStatus  = PHY_RTL8201_GetAutoNegotiationStatus,
		.getLinkStatus      = PHY_RTL8201_GetLinkStatus,
		.getLinkSpeedDuplex = PHY_RTL8201_GetLinkSpeedDuplex,
		.setLinkSpeedDuplex = PHY_RTL8201_SetLinkSpeedDuplex,
		.enableLoopback     = PHY_RTL8201_EnableLoopback,
		.enableLinkInterrupt= PHY_RTL8201_EnableLinkInterrupt,
		.clearInterrupt     = PHY_RTL8201_ClearInterrupt
};


static inline void xether_netc_ep0_phy_reset_pin_set(bool_t reset)
{
	RGPIO_PinWrite(RGPIO4, 13, (reset) ? (0) : (1));
}

static inline void xether_netc_ep1_phy_reset_pin_set(bool_t reset)
{
	RGPIO_PinWrite(RGPIO4, 25, (reset) ? (0) : (1));
}

static inline void xether_netc_ep2_phy_reset_pin_set(bool_t reset)
{
	RGPIO_PinWrite(RGPIO6, 13, (reset) ? (0) : (1));
}

static inline void xether_netc_ep3_phy_reset_pin_set(bool_t reset)
{
	RGPIO_PinWrite(RGPIO4, 28, (reset) ? (0) : (1));
}

static inline void xether_netc_ep4_phy_reset_pin_set(bool_t reset)
{
	RGPIO_PinWrite(RGPIO6, 15, (reset) ? (0) : (1));
}

static status_t APP_Phy8201SetUp(phy_handle_t *handle)
{
    status_t result;
    uint16_t data;

    result = PHY_Write(handle, PHY_PAGE_SELECT_REG, 7);
    if (result != kStatus_Success)
    {
        return result;
    }
    result = PHY_Read(handle, 16, &data);
    if (result != kStatus_Success)
    {
        return result;
    }

    /* CRS/DV pin is RXDV signal. */
    data |= (1U << 2);
    result = PHY_Write(handle, 16, data);
    if (result != kStatus_Success)
    {
        return result;
    }
    result = PHY_Write(handle, PHY_PAGE_SELECT_REG, 0);

    return result;
}

